eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
#include <WiFi.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESP32Servo.h>
// #include <EEPROM.h>
#include "soc/soc.h"             // For `soc_caps.h` and low-level system functions
#include "soc/rtc_cntl_reg.h"    // For `RTC_CNTL_BROWN_OUT_REG`
#include <WiFiManager.h> // https://github.com/tzapu/WiFiManager
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <HardwareSerial.h>
#include <Preferences.h>
#include "bongoCat.h"
// NTP Client
#include <NTPClient.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <time.h> // For time_t, tm, time(), localtime_r(), strftime()

/**
 * @file main.cpp
 * @brief Main firmware for the ESP32 DevKit V1 controlling the Kytsa Laser Toy.
 *
 * This firmware manages WiFi connectivity, WebSocket communication with a remote server,
 * servo control for laser movement, NTP time synchronization, timezone handling,
 * scheduled automated movements ("Kytsa Workouts"), interaction with an ESP32-CAM
 * for video streaming, and an OLED display for status information.
 * It uses Preferences for persistent storage of settings and WiFiManager for
 * initial WiFi configuration.
 */

// Global Objects and Configuration Variables

/** @brief Preferences object for Non-Volatile Storage (NVS). Used to store settings persistently. */
Preferences preferences;

// --- NTP and Time Settings ---
/** @brief UDP client for NTP communication. */
WiFiUDP ntpUDP;
/** @brief NTP client instance for time synchronization. Managed by this firmware. */
NTPClient timeClient(ntpUDP);
/** @brief Timestamp (millis()) of the last successful NTP update. */
unsigned long lastNTPUpdateTime = 0;
/** @brief Interval in milliseconds for attempting NTP updates. Default is 1 hour. Configurable via web UI. */
long ntpUpdateInterval = 60 * 60 * 1000;
/** @brief Timezone POSIX string (e.g., "EST5EDT,M3.2.0/2,M11.1.0/2"). Loaded from NVS, default "UTC0". Configurable. */
String timeZonePosixString = "UTC0";

// --- Motion and Scheduling State ---
/** @brief True if random servo motion is currently manually activated via the web UI. */
bool randomMotionActive = false;
/** @brief True if an active scheduled movement has been temporarily overridden (e.g., by manual stop via UI). Currently not fully implemented. */
bool scheduledMovementOverridden = false;
/** @brief True if a scheduled "Kytsa Workout" is currently active based on NTP time and configured timer slots. */
bool isScheduledMovementActive = false;
/** @brief Flag to indicate if the device is in a special configuration mode (legacy, less relevant with WebSocket). */
bool inConfiguration = false;
/** @brief String storing the HH:MM start time of the currently active or next scheduled movement. For display. */
String currentScheduleStartTime = "";
/** @brief String storing the HH:MM stop time of the currently active or next scheduled movement. For display. */
String currentScheduleStopTime = "";

// --- ESP32-CAM Communication ---
/** @brief HardwareSerial instance (Serial2) used for communication with the ESP32-CAM. */
HardwareSerial& serialPort = Serial2;
/** @brief SSID of the currently connected Wi-Fi network, shared with ESP32-CAM. */
String staSSID;
/** @brief Password for the currently connected Wi-Fi network, shared with ESP32-CAM. */
String staPassword;
/** @brief IP address of the connected ESP32-CAM, received over serial. Empty if not connected/reported. */
String esp32CamIP = "";
/** @brief True if communication with the ESP32-CAM has been established (e.g., IP received). */
bool esp32CamConnected = false;
/** @brief True if the ESP32-CAM is currently commanded to stream video. */
bool streaming = false;
/** @brief True if the ESP32-CAM's LED is currently commanded to be active. */
bool camLedActive = false;

// --- WiFi State ---
/** @brief True if WiFi was connected using credentials obtained via WiFiManager's Access Point mode during the current session. */
bool wifiConnectedAP = false;

// --- Display Settings ---
/** @brief Width of the OLED display in pixels. */
#define SCREEN_WIDTH 128
/** @brief Height of the OLED display in pixels. */
#define SCREEN_HEIGHT 32
/** @brief Reset pin for the OLED display (-1 if not used, managed by I2C). */
#define OLED_RESET     -1
/** @brief Adafruit SSD1306 display object instance. */
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// --- Servo Objects and Pin Definitions ---
/** @brief Servo object for the X-axis (pan). */
Servo myservoX;
/** @brief Servo object for the Y-axis (tilt). */
Servo myservoY;

/** @brief GPIO pin connected to the X-axis servo signal line. */
const int servoPinX = 13;
/** @brief GPIO pin connected to the Y-axis servo signal line. */
const int servoPinY = 12;
/** @brief GPIO pin used to control the laser module. (HIGH for ON, LOW for OFF - needs verification). */
const int outputPin = 25; // Typically for Laser
/** @brief GPIO pin used to control the auxiliary relay. (HIGH for ON, LOW for OFF - needs verification). */
const int relayPin = 26;
/** @brief GPIO pin for Touch Pad 1 (used for sleep/wake and other interactions). */
const int touchPin1 = 32;
/** @brief GPIO pin for Touch Pad 2 (used for settings and other interactions). */
const int touchPin2 = 33;
/** @brief GPIO pin for I2C SDA (connected to OLED display). */
const int SDA_PIN = 21;
/** @brief GPIO pin for I2C SCL (connected to OLED display). */
const int SCL_PIN = 18;

// --- Touch Input and Device State ---
/** @brief Threshold for touch pin sensitivity. Lower values are more sensitive. */
const int threshold = 75;
/** @brief Stores the raw value read from a touch pin. */
int touchValue; // Note: This seems to be a generic variable, might be better localized or removed if not broadly used.
/** @brief True if the laser is currently commanded to be active. Defaults to OFF at boot. Managed by UI commands and automated activities. */
bool laserActive = false;
/** @brief True if the relay is currently commanded to be active. Default ON at boot. */
bool relayActive = true;
/** @brief True if the device is in the touch-based settings adjustment mode. */
bool settingsMode = false;
/** @brief Index for the current setting being adjusted in touch-based settings mode. */
int currentSetting = 0;

