eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
// --- Random Motion Parameters ---
/** @brief Timestamp (millis()) of the last random motion execution. */
unsigned long lastMotionTime = 0;
/** @brief Minimum interval (ms) between random movements when `minVel`/`maxVel` are not used (legacy). */
unsigned long minMotionInterval = 100;
/** @brief Maximum interval (ms) between random movements when `minVel`/`maxVel` are not used (legacy). */
unsigned long maxMotionInterval = 3000;

// --- Timer Schedule Data Structures ---
/**
 * @struct TimeSlot
 * @brief Represents a single scheduled time slot for automated "Kytsa Workouts".
 */
struct TimeSlot {
  int startTimeMinutes; ///< Start time of the slot in minutes from the beginning of the day (0-1439).
  int stopTimeMinutes;  ///< Stop time of the slot in minutes from the beginning of the day (0-1439).
  bool active;          ///< Runtime flag, true if this timeslot is currently considered active by the scheduling logic.
};

/** @brief Maximum number of timer slots that can be configured and stored. */
const int MAX_TIMERS = 5;
/** @brief Array to hold the configured timer slots. */
TimeSlot timeSlots[MAX_TIMERS];
/** @brief Current number of active/configured timer slots in the `timeSlots` array. */
int numTimeSlots = 0; // Initialized to 0, loaded from NVS in setup()

// --- WiFiManager ---
/** @brief WiFiManager object instance for simplified WiFi configuration. */
WiFiManager wm;

// --- Legacy/Unused/General Variables (Review for cleanup) ---
String header; // Potentially for HTTP server responses, seems unused in current WebSocket context.
String valueStringX = String(90); // Seems to be for storing servo X position as string, possibly for older UI.
String valueStringY = String(90); // Seems to be for storing servo Y position as string, possibly for older UI.
int pos1 = 0; // Purpose unclear, potentially legacy.
int pos2 = 0; // Purpose unclear, potentially legacy.

unsigned long currentTime = millis(); // Generic timestamp, often better to get current millis() directly when needed.
unsigned long previousTime = 0;    // Generic timestamp, often better to use specific state variables.
const long timeoutTime = 2000;     // Generic timeout, make specific if used for distinct purposes.

// --- Servo Axis Limits ---
/** @brief Minimum angle for the X-axis servo. Loaded from NVS, default 0. */
int minX = 0;
/** @brief Maximum angle for the X-axis servo. Loaded from NVS, default 180. */
int maxX = 180;
/** @brief Minimum angle for the Y-axis servo. Loaded from NVS, default 45. */
int minY = 45;
/** @brief Maximum angle for the Y-axis servo. Loaded from NVS, default 135. */
int maxY = 135;

// --- Random Movement Velocity/Interval Settings ---
/** @brief Minimum interval (ms) between random movements. Loaded from NVS, default 800ms. Configurable. */
int minVel = 800;
/** @brief Maximum interval (ms) between random movements. Loaded from NVS, default 2000ms. Configurable. */
int maxVel = 2000;
/** @brief Timestamp (millis()) of the last random movement command issued. (Potentially redundant with `lastMotionTime` depending on exact usage). */
unsigned long lastMovementTime = 0; // Review: Seems similar to lastMotionTime.
/** @brief Current interval (ms) between random movements, randomized between `minVel` and `maxVel`. */
unsigned long movementInterval = 1000;

// --- Smooth Servo Movement Tracking ---
/**
 * @struct ServoMovement
 * @brief Structure to manage parameters for smooth, non-blocking servo movement.
 */
struct ServoMovement {
  /** @brief Starting position of the servo for the current movement. */
  int startPos;
  int targetPos;
  unsigned long startTime;
  unsigned long duration;
  /** @brief Flag indicating if the servo is currently executing a movement. */
  bool isMoving;
};

/** @brief Tracks the current movement state for servo X. */
ServoMovement movementX = {0, 0, 0, 0, false}; // Servo X movement tracking
/** @brief Tracks the current movement state for servo Y. */
ServoMovement movementY = {0, 0, 0, 0, false}; // Servo Y movement tracking

// --- WebSocket Global Variables and Configuration ---
/** @brief Instance of the WebSocketsClient library used for communication with the central server. */
WebSocketsClient webSocket;
/** @brief Flag indicating the current connection status of the WebSocket. True if connected, false otherwise. */
bool webSocketConnected = false;
/** @brief Timestamp (millis()) of the last attempt to reconnect the WebSocket. Used to manage reconnection intervals. */
unsigned long webSocketLastReconnectAttempt = 0;
/** @brief Interval in milliseconds between WebSocket reconnection attempts. Default is 5 seconds. */
const unsigned long webSocketReconnectInterval = 5000;
/** @brief Unique identifier for this ESP32 device, derived from its MAC address. Sent during pairing. */
String deviceId = "";
// --- WebSocket Server Details ---
/** @brief Hostname or IP address of the WebSocket server. */
const char* wsHost = "ebski.co";
/** @brief Port number for the WebSocket server (e.g., 80 for ws, 443 for wss). Currently set for non-secure WS. */
const uint16_t wsPort = 80;
/** @brief Path for the WebSocket endpoint on the server (e.g., "/ws"). */
const char* wsPath = "/ws";

/**
 * @brief Function executed upon waking from deep sleep.
 * @note This function is marked with RTC_IRAM_ATTR to be placed in IRAM,
 *       which is necessary for functions executed during deep sleep wakeup.
 *       It re-enables the laser and relay by default after wakeup.
 */
void RTC_IRAM_ATTR esp_wake_deep_sleep() {
  esp_default_wake_deep_sleep(); // Default ESP-IDF deep sleep wake stub
  // Re-initialize desired states after wakeup
  laserActive = true;
  relayActive = true;
  digitalWrite(outputPin, HIGH); // Turn laser ON
  digitalWrite(relayPin, HIGH);  // Turn relay ON
}

/**
 * @brief Generates a unique device ID (chip ID) from the ESP32's MAC address.
 * This ID is used to identify the device to the WebSocket server.
 * @return A String representing the unique chip ID (hexadecimal format).
 */
String getChipId() {
    uint64_t chipid = ESP.getEfuseMac(); // Read MAC address
    char chipid_str[17]; // Buffer for string (16 chars + null terminator)
    snprintf(chipid_str, sizeof(chipid_str), "%04X%08X", (uint16_t)(chipid >> 32), (uint32_t)chipid);
    return String(chipid_str);
}

// Forward declarations for functions called in webSocketEvent
void turnLaserOn();
void turnLaserOff();
void sendSystemConfig(); // Forward declaration for our new function
void addTimeSlot(String startTimeStr, String stopTimeStr); // Ensure it's declared if not already before webSocketEvent
void deleteTimeSlot(int indexToDelete); // Ensure it's declared
void updateDisplay(); // Forward declaration for OLED update


/**
 * @brief Callback function to handle WebSocket events.
 *
 * This function is registered with the WebSocketsClient and is called when various
 * WebSocket events occur, such as connection, disconnection, text messages, etc.
 * It processes incoming commands from the server (originated by the web UI) and
 * manages the WebSocket connection state.
 *
 * @param type The type of WebSocket event (e.g., WStype_DISCONNECTED, WStype_CONNECTED, WStype_TEXT).
 * @param payload Pointer to the payload data for the event. For TEXT events, this is the message string.
 * @param length Length of the payload data in bytes.
 */
void webSocketEvent(WStype_t type, uint8_t * payload, size_t length) {
    // Add a Serial.printf at the top to see ALL event types coming in
    // Serial.printf("[WSc] Event Type Received: %d\n", type);

    switch(type) {
        case WStype_DISCONNECTED:
            Serial.printf("[WSc] Event: WStype_DISCONNECTED\n");
            webSocketConnected = false;
            break;
        case WStype_CONNECTED:
            Serial.printf("[WSc] Event: WStype_CONNECTED to %s\n", (char*)payload);
            webSocketConnected = true;
            // Send pairing message
            {
                StaticJsonDocument<200> doc;
                doc["type"] = "pairing";
                doc["deviceId"] = deviceId;
                String output;
                serializeJson(doc, output);
                webSocket.sendTXT(output);
                Serial.println("Sent pairing message: " + output);
                Serial.println("[DEBUG] Calling sendSystemConfig on WebSocket connect.");
                sendSystemConfig(); // Send initial system config on connect
            }
            break;
        case WStype_TEXT:
            Serial.printf("[WSc] Event: WStype_TEXT\n"); // Log that we entered TEXT handling
            Serial.printf("[WSc] Raw payload received (for WStype_TEXT): %s\n", (char*)payload); // Moved from top of TEXT block
            Serial.printf("[WSc] Payload length (for WStype_TEXT): %u\n", length);    // Moved from top of TEXT block
            // The old "[WSc] get text:" log is redundant if "Raw payload received" is here.

            // Existing code follows
            {
                StaticJsonDocument<384> doc; // Ensure this size is appropriate, 384 should be fine for this command
                DeserializationError error = deserializeJson(doc, payload, length);
                if (error) {
                    Serial.print(F("deserializeJson() failed: "));
                    Serial.println(error.f_str());
                    return;
                }

                // Main command processing path:
                if (doc.containsKey("command")) {
                    const char* command = doc["command"];
                    Serial.printf("[DEBUG] Received standard command: %s\n", command);

                    if (strcmp(command, "addTimer_value") == 0) { // New handler
                        Serial.println("[DEBUG] Received 'addTimer_value' command.");
                        const char* dataStr = doc["value"]; // Expect data in "value" field
                        if (dataStr) {
                            String combinedData = String(dataStr);
                            int semicolonIndex = combinedData.indexOf(';');
                            if (semicolonIndex > 0 && semicolonIndex < combinedData.length() - 1) {
                                String startTimeFromData = combinedData.substring(0, semicolonIndex);
                                String endTimeFromData = combinedData.substring(semicolonIndex + 1);
                                Serial.printf("[DEBUG] Parsed from 'value' string -> startTime: %s, endTime: %s\n", startTimeFromData.c_str(), endTimeFromData.c_str());
                                addTimeSlot(startTimeFromData, endTimeFromData);
                            } else {
                                Serial.println("[DEBUG] 'addTimer_value' invalid 'value' field format. Expected 'HH:MM;HH:MM'.");
                            }
                        } else {
                            Serial.println("[DEBUG] 'addTimer_value' missing 'value' field.");
                        }
                        sendSystemConfig(); // Update client
                    } // <<< ****** ADDED MISSING CLOSING BRACE HERE ******
                    // Deprecated addTimer handlers fully removed.
                    // Standard commands:
                    else if (strcmp(command, "servoX") == 0) {
                        int val = doc["value"];
                        myservoX.write(val);
                        valueStringX = String(val);
                        Serial.printf("Executed servoX: %d\n", val);
                    } else if (strcmp(command, "servoY") == 0) {
                        int val = doc["value"];
                        myservoY.write(val);
                        valueStringY = String(val);
                        Serial.printf("Executed servoY: %d\n", val);
                    } else if (strcmp(command, "LASER_ON") == 0) {
                        turnLaserOn(); // Directly controls digitalWrite
                        laserActive = true; // Update state flag
                        Serial.println("Executed LASER_ON, laserActive set to true");
                    } else if (strcmp(command, "LASER_OFF") == 0) {
                        turnLaserOff(); // Directly controls digitalWrite
                        laserActive = false; // Update state flag
                        Serial.println("Executed LASER_OFF, laserActive set to false");
                    } else if (strcmp(command, "RELAY_ON") == 0) {
                        digitalWrite(relayPin, HIGH);
                        relayActive = true;
                        Serial.println("Executed RELAY_ON");
                    } else if (strcmp(command, "RELAY_OFF") == 0) {
                        digitalWrite(relayPin, LOW);
                        relayActive = false;
                        Serial.println("Executed RELAY_OFF");
                    } else if (strcmp(command, "RANDOM_MOTION_TOGGLE") == 0) {
                        randomMotionActive = !randomMotionActive;
                        Serial.printf("Random motion toggled: %s\n", randomMotionActive ? "ON" : "OFF");
                        sendSystemConfig(); // Send feedback for UI update
                    }
                    // Commands for ESP32CAM
                    else if (strcmp(command, "START_STREAM") == 0) {
                        Serial2.println("START_STREAM");
                        Serial.println("Sent command to ESP32CAM: START_STREAM");
                        streaming = true;
                    } else if (strcmp(command, "STOP_STREAM") == 0) {
                        Serial2.println("STOP_STREAM");
                        Serial.println("Sent command to ESP32CAM: STOP_STREAM");
                        streaming = false;
                    } else if (strcmp(command, "CAM_LED_ON") == 0) {
                        Serial2.println("LED_ON");
                        Serial.println("Sent command to ESP32CAM: LED_ON");
                        camLedActive = true;
                    } else if (strcmp(command, "CAM_LED_OFF") == 0) {
                        Serial2.println("LED_OFF");
                        Serial.println("Sent command to ESP32CAM: LED_OFF");
                        camLedActive = false;
                    } else if (strcmp(command, "getSystemConfig") == 0) {
                        Serial.println("[DEBUG] Received 'getSystemConfig' command.");
                        Serial.println("[DEBUG] Calling sendSystemConfig for getSystemConfig command.");
                        sendSystemConfig();
                    } else if (strcmp(command, "setServoLimit") == 0) {
                        const char* axis = doc["axis"];
                        const char* limit_type = doc["limit_type"];
                        int value = doc["value"]; // Assuming value is passed as int
                        if (axis && limit_type) { // Basic null check
                            Serial.printf("Received setServoLimit: axis=%s, type=%s, value=%d\n", axis, limit_type, value);
                            preferences.begin("servo_config", false);
                            if (strcmp(axis, "x") == 0 && strcmp(limit_type, "min") == 0) { minX = value; preferences.putInt("min_x", minX); }
                            else if (strcmp(axis, "x") == 0 && strcmp(limit_type, "max") == 0) { maxX = value; preferences.putInt("max_x", maxX); }
                            else if (strcmp(axis, "y") == 0 && strcmp(limit_type, "min") == 0) { minY = value; preferences.putInt("min_y", minY); }
                            else if (strcmp(axis, "y") == 0 && strcmp(limit_type, "max") == 0) { maxY = value; preferences.putInt("max_y", maxY); }
                            preferences.end();
                            Serial.printf("Updated limits: minX=%d, maxX=%d, minY=%d, maxY=%d\n", minX, maxX, minY, maxY);
                            sendSystemConfig(); // Send updated config
                        } else {
                             Serial.println("[ERROR] setServoLimit: missing axis or limit_type.");
                        }
                    }
                    else if (strcmp(command, "deleteTimer") == 0) {
                        int timerIndex = doc["timerIndex"];
                        Serial.printf("Received deleteTimer: index=%d\n", timerIndex);
                        deleteTimeSlot(timerIndex);
                        sendSystemConfig();
                    } else if (strcmp(command, "setPreference") == 0) {
                        const char* key = doc["key"];
                        if (key) {
                            preferences.begin("servo_config", false);
                            bool preferenceChanged = false;
                            if (strcmp(key, "min_x") == 0) { minX = doc["value"].as<int>(); preferences.putInt("min_x", minX); preferenceChanged = true; }
                            else if (strcmp(key, "max_x") == 0) { maxX = doc["value"].as<int>(); preferences.putInt("max_x", maxX); preferenceChanged = true; }
                            else if (strcmp(key, "min_y") == 0) { minY = doc["value"].as<int>(); preferences.putInt("min_y", minY); preferenceChanged = true; }
                            else if (strcmp(key, "max_y") == 0) { maxY = doc["value"].as<int>(); preferences.putInt("max_y", maxY); preferenceChanged = true; }
                            else if (strcmp(key, "min_vel") == 0) { minVel = doc["value"].as<int>(); preferences.putInt("min_vel", minVel); preferenceChanged = true; }
                            else if (strcmp(key, "max_vel") == 0) { maxVel = doc["value"].as<int>(); preferences.putInt("max_vel", maxVel); preferenceChanged = true; }
                            // Removed obsolete 'timezone' (integer offset) case
                            else if (strcmp(key, "timezone_posix") == 0) {
                                timeZonePosixString = doc["value"].as<String>();
                                preferences.putString("tz_posix", timeZonePosixString);

                                // Set the Timezone environment variable
                                Serial.printf("[WSc] Setting TZ environment variable to: %s\n", timeZonePosixString.c_str());
                                setenv("TZ", timeZonePosixString.c_str(), 1);
                                tzset(); // Apply the TZ setting

                                // Re-configure system time with NTP server. Offsets are 0 as TZ env var handles it.
                                // configTime(0, 0, "pool.ntp.org"); // Not strictly necessary to call this again if NTP servers haven't changed
                                                                    // and if sntp is already running. tzset() is the key.
                                Serial.printf("[WSc] System TZ updated. Current NTP server 'pool.ntp.org'. TZ set by environment: %s\n", timeZonePosixString.c_str());

                                timeClient.setTimeOffset(0); // Ensure NTPClient knows its offset is 0 relative to system time

                                Serial.println("[WSc] Attempting to update NTP time immediately after timezone change...");
                                if (timeClient.update()) {
                                   Serial.println("[WSc] NTP time updated successfully after timezone change.");
                                } else {
                                   Serial.println("[WSc] NTP time update failed after timezone change. Will retry on next interval.");
                                }
                                lastNTPUpdateTime = millis(); // Reset NTP update timer to force update sooner if configured interval is long
                                preferenceChanged = true;
                                Serial.printf("[WSc] Timezone POSIX string updated to: %s and applied.\n", timeZonePosixString.c_str());
                                updateDisplay(); // Force OLED update to reflect new time immediately
                            }
                            else if (strcmp(key, "ntp_interval") == 0) {
                                ntpUpdateInterval = doc["value"].as<long>(); // Value is in ms from web UI
                                preferences.putLong("ntp_interval", ntpUpdateInterval);
                                // NTPClient doesn't have a setUpdateInterval method after begin.
                                // The new interval will be used on the next check in loop().
                                preferenceChanged = true;
                            }
                            else { Serial.printf("[WSc] Unknown preference key: %s\n", key); }

                            if (preferenceChanged) {
                                Serial.printf("[WSc] Preference updated: %s = %s\n", key, doc["value"].as<String>().c_str());
                                preferences.end();
                                sendSystemConfig(); // Send updated config to all clients
                            } else {
                                preferences.end(); // Still need to end if no known key matched
                            }
                        } else {
                            Serial.println("[WSc] setPreference command missing 'key'.");
                        }
                    }
                    else {
                        Serial.printf("[DEBUG] Unknown standard command: %s\n", command);
                    }
                } else {
                    Serial.println("[WSc] Received JSON without 'command' key (and not hyper-simplified 'c':'at').");
                }
            }
            break;
        case WStype_BIN:
            Serial.printf("[WSc] get binary length: %u\n", length);
            // hexdump(payload, length); // Example if needed
            break;
        case WStype_ERROR:
            Serial.printf("[WSc] Event: WStype_ERROR - error: %s\n", (char*)payload);
            webSocketConnected = false;
            break;

        // ADD OR MODIFY THESE CASES FOR FRAGMENTATION LOGGING:
        case WStype_FRAGMENT_TEXT_START:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_TEXT_START\n");
            break;
        case WStype_FRAGMENT_BIN_START:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_BIN_START\n");
            break;
        case WStype_FRAGMENT:
            Serial.printf("[WSc] Event: WStype_FRAGMENT - Current fragment length: %u\n", length);
            // Avoid printing payload here unless sure it's text and null-terminated or handled carefully,
            // as fragments are not necessarily complete messages.
            // For debugging, if you know it's text and want a peek:
            // if (length > 0 && payload) {
            //    char buf[33]; // Print up to 32 chars + null terminator
            //    memcpy(buf, payload, length < 32 ? length : 32);
            //    buf[length < 32 ? length : 32] = '\0'; // Ensure null termination
            //    Serial.printf("[WSc] Fragment Data Peek: %s\n", buf);
            // }
            break;
        case WStype_FRAGMENT_FIN:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_FIN - Final fragment length: %u\n", length);
            // After this, the library should internally reassemble and then issue a WStype_TEXT or WStype_BIN event
            // with the complete payload.
            break;

        default:
            Serial.printf("[WSc] Event: Unknown WStype_t: %d\n", type);
            break;
    }
}

