eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
/**
 * @brief Callback function triggered by WiFiManager when new WiFi credentials are saved.
 *
 * This function updates global variables `wifiConnectedAP`, `staSSID`, and `staPassword`
 * with the new credentials. It is typically used when WiFiManager has been in AP mode
 * and successfully obtained credentials from the user.
 * @note This function is registered with `wm.setSaveConfigCallback(saveWifiCallback);`
 *       but that line is currently commented out in `setup()`.
 */
void saveWifiCallback() {
  Serial.println("WiFi credentials saved by WiFiManager.");
  wifiConnectedAP = true; // Indicate that WiFi was connected/configured via AP mode this session.
  staSSID = WiFi.SSID();
  staPassword = WiFi.psk();
}

/**
 * @brief Gets the current time as a formatted string (HH:MM:SS) from the NTPClient.
 * @note This time is UTC unless the NTPClient's offset is explicitly set,
 *       which is not the case here as `timeClient.setTimeOffset(0)` is used.
 *       For localized time, use `time_t` with `localtime_r` and `strftime`.
 * @return String containing the formatted time (HH:MM:SS).
 */
String getFormattedTime() {
  return timeClient.getFormattedTime(); // NTPClient's formatted time (usually UTC)
}

/**
 * @brief Converts a time string in "HH:MM" format to total minutes from the start of the day.
 *
 * @param formattedTime A String representing time in "HH:MM" format.
 * @return int Total minutes from midnight (0-1439), or -1 if the input format is invalid or time is out of range.
 */
int timeToMinutes(String formattedTime) {
  if (formattedTime.length() != 5 || formattedTime.charAt(2) != ':') {
    Serial.println("Invalid time format for timeToMinutes: " + formattedTime + ". Expected HH:MM");
    return -1;
  }
  int hours = formattedTime.substring(0, 2).toInt();
  int minutes = formattedTime.substring(3, 5).toInt();
  if (hours < 0 || hours > 23 || minutes < 0 || minutes > 59) {
    Serial.println("Invalid time value for timeToMinutes: " + formattedTime + ". Values out of range.");
    return -1;
  }
  return hours * 60 + minutes;
}

/**
 * @brief Converts total minutes from the start of the day to a time string in "HH:MM" format.
 *
 * @param totalMinutes Total minutes from midnight (0-1439).
 * @return String Time in "HH:MM" format, or "N/A" if `totalMinutes` is out of valid range.
 */
String minutesToTime(int totalMinutes) {
  if (totalMinutes < 0 || totalMinutes >= (24 * 60)) {
    // Serial.printf("Invalid totalMinutes value for minutesToTime: %d\n", totalMinutes); // Optional: Log this
    return "N/A";
  }
  int hours = (totalMinutes / 60) % 24;
  int minutes = totalMinutes % 60;
  return String(hours < 10 ? "0" : "") + String(hours) + ":" + String(minutes < 10 ? "0" : "") + String(minutes);
}

/**
 * @brief Turns the laser connected to `outputPin` ON.
 * Assumes `outputPin` is correctly configured as OUTPUT.
 */
void turnLaserOn() {
  digitalWrite(outputPin, HIGH);
  // laserActive = true; // State variable 'laserActive' should be updated by caller if this function is used standalone.
}

/**
 * @brief Turns the laser connected to `outputPin` OFF.
 * Assumes `outputPin` is correctly configured as OUTPUT.
 */
void turnLaserOff() {
  digitalWrite(outputPin, LOW);
  // laserActive = false; // State variable 'laserActive' should be updated by caller.
}

/**
 * @brief Displays a message on the OLED screen prompting the user to connect to the WiFiManager Access Point ("MiauAP").
 * This is typically called when WiFiManager enters AP mode.
 */
void displayConnectAPMessage() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.println("Connect to WiFi:");
  display.setTextSize(2); // Larger text for AP name
  display.println("MiauAP");
  display.display();
}


/**
 * @brief Callback function for WiFiManager when it enters configuration mode (Access Point mode).
 *
 * This function calls `displayConnectAPMessage()` to show instructions on the OLED.
 * @param myWiFiManager Pointer to the WiFiManager instance. Not used in this function but required by the callback signature.
 */
void configModeCallback (WiFiManager *myWiFiManager) {
  // Parameter myWiFiManager is not used in this specific callback implementation,
  // but it's part of the function signature required by WiFiManager.
  // (void)myWiFiManager; // Optional: suppress unused parameter warning if compiler flags are strict.
  displayConnectAPMessage();
}

/**
 * @brief Displays a short "Bongo Cat" animation sequence on the OLED.
 * Used as a startup animation.
 */
void showBongoCat(){
  // Frame 1: Base Bongo Cat
  display.drawBitmap(0, 0, bongocat, 128, 32, WHITE);
  display.display();
  delay(10);
  // if(digitalRead(input_left) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[0], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
  // if(digitalRead(input_right) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[1], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
}

/**
 * @brief Initializes the ESP32 DevKitV1 board.
 *
 * This function performs the following setup tasks:
 * - Disables the brownout detector.
 * - Initializes Serial communication (both primary and Serial2 for ESP32CAM).
 * - Generates and stores the unique device ID.
 * - Initializes I2C communication for the OLED display.
 * - Initializes the OLED display and shows a startup animation.
 * - Enables touch wakeup functionality.
 * - Loads saved configuration settings (servo limits, velocities, timezone, NTP interval, timers) from Preferences (NVS).
 * - Initializes output pins for laser and relay.
 * - Attaches and initializes servo motors to their default positions.
 * - Sets up WiFiManager for Wi-Fi connection and credential management.
 *   - If autoConnect fails, it starts a configuration portal.
 *   - On successful connection, initializes the NTP client for time synchronization.
 * - Initializes ArduinoOTA for over-the-air updates.
 * - Initializes the WebSocket client and sets up its event handler and reconnect interval.
 */
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable brownout detector
  Serial.begin(115200);
  deviceId = getChipId();
  Serial.println("Device ID: " + deviceId);
  Serial2.begin(115200); // Initialize Serial2
  // Initialize I2C communication
  Wire.begin(SDA_PIN, SCL_PIN);

  // Initialize OLED display
  if(!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) { // Address 0x3C for 128x32
    Serial.println(F("SSD1306 allocation failed"));
    for(;;);
  }

  // Play the tap animation 6 times at startup
  for (int i = 0; i < 3; i++) {
showBongoCat();
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.print("Connecting to Wi-Fi..");
  display.display();

  touchSleepWakeUpEnable(T9, 75); // Enable touch wakeup


