eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  preferences.begin("servo_config"); // Namespace for our preferences

  minX = preferences.getInt("min_x", 0); // Default to 0 if not found
  maxX = preferences.getInt("max_x", 180); // Default to 180 if not found
  minY = preferences.getInt("min_y", 45); // Default to 0 if not found
  maxY = preferences.getInt("max_y", 135); // Default to 180 if not found
  minVel = preferences.getInt("min_vel", 800); // Default to 800 if not found
  maxVel = preferences.getInt("max_vel", 2000); // Default to 2000 if not found
  timeZonePosixString = preferences.getString("tz_posix", "UTC0"); // Load POSIX TZ string
  ntpUpdateInterval = preferences.getLong("ntp_interval", 60 * 60 * 1000); // Load interval
  Serial.print("Loaded Timezone POSIX String (Preferences): ");
  Serial.println(timeZonePosixString);
  Serial.print("Loaded NTP Update Interval (Preferences): ");
  Serial.println(ntpUpdateInterval);

  Serial.print("Loaded Min Velocity (Preferences): ");
  Serial.println(minVel);
  Serial.print("Loaded Max Velocity (Preferences): ");
  Serial.println(maxVel);

  // Timezone will be set after WiFi connection and configTime.
  // Serial.printf("Setting TZ environment variable from preferences: %s\n", timeZonePosixString.c_str()); // Old position
  // setenv("TZ", timeZonePosixString.c_str(), 1); // Old position
  // tzset(); // Old position
  // Serial.println("System TZ applied from preferences."); // Old position

  // NTP Client will be initialized after WiFi connects.

  // Load num_timers first to know how many slots were previously saved.
  // This value might be adjusted later if some slots are found to be invalid.
  numTimeSlots = preferences.getInt("num_timers", 0);
  Serial.printf("[DEBUG] Loaded num_timers from preferences: %d\n", numTimeSlots);

  // Revised Timer Loading Logic
  int validSlotsCount = 0;
  for (int i = 0; i < MAX_TIMERS; i++) { // Iterate up to MAX_TIMERS to check all possible stored slots
      String baseKey = "timer_" + String(i);
      int startMins = preferences.getInt((baseKey + "_start").c_str(), -1);
      int stopMins = preferences.getInt((baseKey + "_stop").c_str(), -1);
      Serial.printf("[DEBUG] Slot %d: Read startMins=%d, stopMins=%d from Prefs\n", i, startMins, stopMins);

      // Enhanced validation: valid range AND non-zero duration
      if (startMins >= 0 && startMins < (24*60) &&
          stopMins >= 0 && stopMins < (24*60) &&
          startMins != stopMins) {

          // This is a valid timer slot, proceed to load/compact it
          if (validSlotsCount < i) { // Compact valid timers to the front of the array
              timeSlots[validSlotsCount].startTimeMinutes = startMins;
              timeSlots[validSlotsCount].stopTimeMinutes = stopMins;
          } else { // validSlotsCount == i
               // If we always assign to timeSlots[validSlotsCount], this branch might not be strictly needed
               // as timeSlots[i] would be timeSlots[validSlotsCount]
               timeSlots[validSlotsCount].startTimeMinutes = startMins;
               timeSlots[validSlotsCount].stopTimeMinutes = stopMins;
          }
          timeSlots[validSlotsCount].active = false; // Initialize as not active
          Serial.printf("[DEBUG] Loaded Valid Timer %d (from slot %d): Start=%d, Stop=%d\n", validSlotsCount, i, timeSlots[validSlotsCount].startTimeMinutes, timeSlots[validSlotsCount].stopTimeMinutes);
          validSlotsCount++;
      } else {
          // This timer is invalid (e.g. -1 in prefs, out of minute range, or zero duration)
          Serial.printf("[DEBUG] Invalid or zero-duration timer (Start: %d, Stop: %d) from Prefs for slot %d - Skipping.\n", startMins, stopMins, i);
          // No need to explicitly remove from preferences here if we save the compacted valid list later
          // If we compact, any old data at timeSlots[i] from a previous run will be overwritten by a valid timer
          // or left as is if no more valid timers are found.
          // If we want to ensure all non-loaded slots in timeSlots array are -1, we could explicitly set them:
          // timeSlots[i].startTimeMinutes = -1;
          // timeSlots[i].stopTimeMinutes = -1;
          // However, the loop for schedule checking only goes up to numTimeSlots.
      }
  }
  numTimeSlots = validSlotsCount; // Set numTimeSlots to the actual number of valid timers found
  Serial.printf("[DEBUG] Final numTimeSlots after loading and validation: %d\n", numTimeSlots);

  Serial.printf("[DEBUG] Saving num_timers=%d back to preferences.\n", numTimeSlots);
  preferences.putInt("num_timers", numTimeSlots); // Update the stored count of timers to reflect only valid ones found now.

  // preferences.end(); // Moved this call to after all preference reads/writes in setup if it was here.
                      // It seems preferences.begin() is called once, and end() should be at the very end of setup's preference usage.
                      // For now, assuming it's handled globally or later in setup. If not, this needs placement.
                      // The original code has preferences.begin("servo_config") and no preferences.end() in setup.
                      // This is not ideal. It should be preferences.end() after all preference operations are done for this scope.
                      // For this change, I'll assume the existing structure and only add putInt for num_timers.
                      // A full review of preference handling scope would be a separate task.

  // Set pins to output and initialize as ON
  pinMode(outputPin, OUTPUT);
  pinMode(relayPin, OUTPUT);
  turnLaserOn();
  delay(500);
  turnLaserOff(); // Physical laser pin is now LOW. laserActive is already false by global default.
  // laserActive = false; // This line is now redundant due to global default.
  // Serial.println("Laser test in setup complete. Initial laserActive state set to false."); // Redundant log.
  digitalWrite(relayPin, HIGH);
  // Calculate halfway positions
  // int initialX = (minX + maxX) / 2;
  // int initialY = (minY + maxY) / 2;
  int initialX = 90;
  int initialY = 90;

