eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  // char *current_tz_env = getenv("TZ"); // Diagnostic logging removed
  // Serial.printf("[updateDisplay] Current getenv(\"TZ\"): %s\n", current_tz_env ? current_tz_env : "NULL"); // Diagnostic logging removed

  if (WiFi.status() == WL_CONNECTED) {
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("Time: ");

    time_t now;
    time(&now); // Get current epoch time
    // Serial.printf("updateDisplay: Raw epoch from time(): %lu\n", (unsigned long)now); // Logging removed

    if (now < 1609459200L) { // Check if time is past Jan 1, 2021 UTC (example threshold)
        display.println("Time not set");
        // Serial.printf("[updateDisplay] Time not set. Raw time_t: %lu\n", (unsigned long)now); // Diagnostic logging removed
    } else {
        // Serial.printf("[updateDisplay] Raw time_t 'now': %lu\n", (unsigned long)now); // Diagnostic logging removed
        struct tm timeinfo;
        localtime_r(&now, &timeinfo);
        // Serial.printf("[updateDisplay] timeinfo after localtime_r: Y=%d, M=%d, D=%d, H=%d, M=%d, S=%d, DST=%d\n", // Diagnostic logging removed
        //               timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday, // Diagnostic logging removed
        //               timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec, // Diagnostic logging removed
        //               timeinfo.tm_isdst); // Diagnostic logging removed

        char buffer[12]; // Buffer for HH:MM:SS + null
        strftime(buffer, sizeof(buffer), "%H:%M:%S", &timeinfo);
        display.println(buffer);
    }

    display.setCursor(0, 16); // Move to the second half of the screen

    if (isScheduledMovementActive) {
      display.println("Scheduled movement");
      display.printf("%s - %s", currentScheduleStartTime.c_str(), currentScheduleStopTime.c_str());
    } else if (randomMotionActive) {
      display.println("Random movement");
    } else {
      display.println("Standby");
    }
  } else {
    display.println("WiFi Disconnected");
  }
  display.display();
}

// Function to start a smooth servo movement
/**
 * @brief Initiates a smooth, non-blocking movement for a specified servo.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 * @param targetPos The target position (angle) for the servo.
 * @param moveTime The total duration in milliseconds the movement should take.
 */
void startServoMovement(Servo& servo, ServoMovement &movement, int targetPos, int moveTime) {
  movement.startPos = servo.read();
  movement.targetPos = targetPos;
  movement.startTime = millis();
  movement.duration = moveTime;
  movement.isMoving = true;
}

// Function to update servo position smoothly (non-blocking)
/**
 * @brief Updates the position of a servo during a smooth movement.
 * Call this repeatedly in the loop for each servo that might be moving.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 */
void updateServoMovement(Servo& servo, ServoMovement &movement) {
  if (movement.isMoving) {
    unsigned long elapsedTime = millis() - movement.startTime;
    if (elapsedTime >= movement.duration) {
      servo.write(movement.targetPos);  // Final position
      movement.isMoving = false; // Stop the movement
    } else {
      float progress = float(elapsedTime) / movement.duration;
      int currentPos = movement.startPos + (movement.targetPos - movement.startPos) * progress;
      servo.write(int(currentPos));
    }
  }
}
// Function to test servo movement by moving it from min to max and back
void testServo(Servo& servo, int minPos, int maxPos) {
  servo.write(minPos);
  delay(1000);  // Wait for movement to complete
  servo.write(maxPos);
}

/**
 * @brief Manages random, non-blocking movements for both servos.
 *
 * When called, if enough time has passed since the last random move (defined by `movementInterval`),
 * it calculates new random target positions for both servos within their configured min/max ranges.
 * It then calculates a movement duration based on the distance to travel and initiates
 * smooth movements using `startServoMovement()`. A new random `movementInterval` is set for the next cycle.
 */
void moveServosRandomlyNonBlocking() {
    unsigned long currentMillis = millis();

    if (currentMillis - lastMotionTime >= movementInterval) {
      lastMotionTime = currentMillis;

      int currentX = myservoX.read();
      int currentY = myservoY.read();
      int randomX = random(minX, maxX + 1); // Random position for X
      int randomY = random(minY, maxY + 1); // Random position for Y

      // Calculate the distance to travel for each servo
      int distanceX = abs(randomX - currentX);
      int distanceY = abs(randomY - currentY);
      int maxDistance = max(distanceX, distanceY); // Consider the larger movement

      // Determine the movement duration based on the distance
      // You can adjust these scaling factors to control the speed
      unsigned long minMoveTime = 1000; // Minimum time for any movement
      unsigned long baseMoveTime = maxDistance * 500; // Example: 15 ms per degree
      unsigned long maxMoveTime = 3000; // Maximum allowed movement time

      int moveTimeX = constrain(baseMoveTime, minMoveTime, maxMoveTime);
      int moveTimeY = constrain(baseMoveTime, minMoveTime, maxMoveTime);

      // Start the movements
      startServoMovement(myservoX, movementX, randomX, moveTimeX);
      startServoMovement(myservoY, movementY, randomY, moveTimeY);

      // Set a new random interval for the NEXT move using configured minVel and maxVel
      movementInterval = random(minVel, maxVel + 1);

    }
}

// Function to display settings on OLED
void displaySettings() {
  Serial.println("Entering displaySettings()"); // Add this line
  display.clearDisplay();
  display.setCursor(0, 0);

  if (settingsMode) {
    Serial.println("settingsMode is TRUE"); // Add this line
    display.println("SETTINGS MODE");

    switch (currentSetting) {
      case 0: display.print("MinX: "); break;
      case 1: display.print("MaxX: "); break;
      case 2: display.print("MinY: "); break;
      case 3: display.print("MaxY: "); break;
    }

    switch (currentSetting) {
      case 0: display.println(minX); break;
      case 1: display.println(maxX); break;
      case 2: display.println(minY); break;
      case 3: display.println(maxY); break;
    }
  } else {
    Serial.println("settingsMode is FALSE"); // Add this line
    display.print("Servo X: "); display.println(myservoX.read());
    display.print("Servo Y: "); display.println(myservoY.read());
    if (WiFi.status() == WL_CONNECTED) {
      display.print("IP: "); display.println(WiFi.localIP());
    } else {
      display.print("Not Connected");
    }
  }
  display.display(); 
  Serial.println("Exiting displaySettings()"); // Add this line
}

