eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
// Modified adjustSettings function to use Preferences
void adjustSettings(int setting, bool increment) {
  switch (setting) {
    case 0: preferences.putInt("min_x", constrain(preferences.getInt("min_x", 0) + (increment ? 1 : -1), 0, 180)); break;
    case 1: preferences.putInt("max_x", constrain(preferences.getInt("max_x", 180) + (increment ? 1 : -1), 0, 180)); break;
    case 2: preferences.putInt("min_y", constrain(preferences.getInt("min_y", 45) + (increment ? 1 : -1), 45, 135)); break;
    case 3: preferences.putInt("max_y", constrain(preferences.getInt("max_y", 134) + (increment ? 1 : -1), 45, 135)); break;
  }
  displaySettings();
}

void readTouch() {
  static unsigned long touchStartTime1 = 0;
  static bool touchInProgress1 = false;
  static bool shortTouchProcessed1 = false;
  static bool longTouchProcessed1 = false;

  static unsigned long touchStartTime2 = 0;
  static bool touchInProgress2 = false;
  static bool shortTouchProcessed2 = false;
  static bool longTouchProcessed2 = false;

  int touchValue1 = touchRead(touchPin1);
  int touchValue2 = touchRead(touchPin2);

  // Handle Touch Pin 1 (GPIO 32) - Sleep/Wake
  if (touchValue1 < threshold) {
    if (!touchInProgress1) {
      touchStartTime1 = millis();
      touchInProgress1 = true;
      shortTouchProcessed1 = false;
      longTouchProcessed1 = false;
    } else {
      unsigned long touchDuration1 = millis() - touchStartTime1;

      if (touchDuration1 >= 10000) {
        Serial.println("Touch 1 held for 10 seconds - Restarting ESP32...");
        ESP.restart();
      }

      if (touchDuration1 >= 500 && !longTouchProcessed1 && touchDuration1 < 10000) {
        // Sleep
        Serial.println("Long Touch 1 Detected - Turning OFF laser and relay");
        Serial2.println("STOP_STREAM");
        display.clearDisplay();
        display.setCursor(0, 0);
        display.print("Powering Down...");
        display.display();
        delay(2000);
        display.ssd1306_command(SSD1306_DISPLAYOFF);
        laserActive = false;
        relayActive = false;
        digitalWrite(outputPin, LOW);
        digitalWrite(relayPin, LOW);
        randomMotionActive = false;
        longTouchProcessed1 = true;
        delay(1000);
        esp_deep_sleep_start();
      }

      if (touchDuration1 < 500 && !shortTouchProcessed1 && !laserActive && !relayActive) {
        // Wake
        Serial.println("Short Touch 1 Detected - Turning ON laser and relay");
        display.ssd1306_command(SSD1306_DISPLAYON);
        display.clearDisplay();
        display.setCursor(0, 0);
        display.print("Waking...");
        display.display();
        delay(2000);
        updateDisplay();
        laserActive = true;
        relayActive = true;
        digitalWrite(outputPin, HIGH);
        digitalWrite(relayPin, HIGH);
        shortTouchProcessed1 = true;
      }
    }
  } else {
    touchInProgress1 = false;
    shortTouchProcessed1 = false;
    longTouchProcessed1 = false;
  }

  // Handle Touch Pin 2 (GPIO 33) - Settings and Random Motion
  static int currentSetting = 0; // 0: minX, 1: maxX, 2: minY, 3: maxY
  static bool settingsMode = false;

  if (touchValue2 < threshold) {
    if (!touchInProgress2) {
      touchStartTime2 = millis();
      touchInProgress2 = true;
      shortTouchProcessed2 = false;
      longTouchProcessed2 = false;
    } else {
      unsigned long touchDuration2 = millis() - touchStartTime2;

      if (touchDuration2 >= 500 && !longTouchProcessed2) {
        // Toggle Settings Mode
        Serial.println("Long Touch 2 Detected");
        longTouchProcessed2 = true;

        settingsMode = !settingsMode;  // Toggle settings mode *FIRST*

        displaySettings();             // *THEN* update the display
        delay(50);                     // Small delay to allow display update

        if (settingsMode) {
          Serial.println("Entering settings mode.");
        } else {
          Serial.println("Exiting settings mode.");
        }
      }

      if (touchDuration2 < 500 && !shortTouchProcessed2) {
        shortTouchProcessed2 = true;
        if (!settingsMode) {
          // Toggle Random Motion
          randomMotionActive = !randomMotionActive;
          if (randomMotionActive) {
            Serial.println("Random motion is now active.");
          } else {
            Serial.println("Random motion is now inactive.");
          }
        } else {
          // Adjust Settings (using both buttons)
          if (touchValue1 < threshold) { // If Touch 1 is also pressed (decrement)
            adjustSettings(currentSetting, false); // Decrement
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          } else {  // If only Touch 2 is pressed (increment)
            adjustSettings(currentSetting, true); // Increment
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          }
          currentSetting = (currentSetting + 1) % 4; // Cycle through 0-3
          Serial.print("Next setting to adjust "); Serial.println(currentSetting);
        }
      }
    }
  } else { // Touch is released!
    touchInProgress2 = false;
    shortTouchProcessed2 = false;
    longTouchProcessed2 = false;  // Reset here!
  }
}

/**
 * @brief Main loop of the ESP32 DevKitV1 application.
 *
 * This function is executed repeatedly and handles the core logic:
 * - Handles ArduinoOTA updates.
 * - Processes WebSocket client events and reconnection logic.
 * - Reads touch pin inputs for sleep/wake and settings adjustment.
 * - Manages scheduled movements based on NTP time and configured time slots.
 * - Controls random servo movements if enabled (either by schedule or manual toggle).
 * - Updates servo positions for smooth, non-blocking movements.
 * - Updates the OLED display based on current mode (normal, settings) and status.
 * - Sends periodic status updates to the WebSocket server.
 * - Handles serial communication with the ESP32CAM (receiving status, sending commands).
 * - Manages WiFi connection using WiFiManager, attempting to reconnect if disconnected.
 * - Forwards commands received via main Serial to the ESP32CAM via Serial2.
 * - Periodically updates NTP time.
 */
void loop() {
  ArduinoOTA.handle();
  webSocket.loop();
  readTouch();

  if (!webSocketConnected && WiFi.status() == WL_CONNECTED) {
    if (millis() - webSocketLastReconnectAttempt > webSocketReconnectInterval) {
      webSocketLastReconnectAttempt = millis();
      Serial.println("Attempting to reconnect WebSocket...");
      // webSocket.begin() should ideally handle reconnection attempts if using setReconnectInterval
      // but an explicit begin call might be needed if the initial connection fails repeatedly.
      // For now, rely on setReconnectInterval and internal handling.
      // If connection drops, the library should try to reconnect.
      // If initial connect fails, this might need an explicit webSocket.connect(host,port,path) or begin again.
      // Let's assume library handles reconnects for now. If not, add explicit webSocket.connect() here.
    }
  }

