eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  bool shouldMoveRandomlyThisCycle = false;
  String scheduledStartTime = ""; // Local variables to store the times
  String scheduledStopTime = "";

  // Use local time for schedule checking
  time_t now_epoch;
  time(&now_epoch); // Get current epoch time

  if (now_epoch < 1609459200L) { // Check if time is plausible (e.g., past Jan 1, 2021 UTC)
    // Serial.println("[LOOP] System time not yet synchronized or valid for schedule check.");
  } else {
    struct tm timeinfo_local;
    localtime_r(&now_epoch, &timeinfo_local); // Convert to local time structure

    char localTimeStr[6]; // HH:MM + null terminator
    strftime(localTimeStr, sizeof(localTimeStr), "%H:%M", &timeinfo_local);
    String currentTimeForLogic = String(localTimeStr);

    // Serial.printf("[DEBUG] Local time for schedule logic: %s\n", currentTimeForLogic.c_str());

    int currentMinutes = timeToMinutes(currentTimeForLogic);

    if (currentMinutes == -1) { // timeToMinutes might return -1 if format is wrong (should not happen with strftime)
        Serial.println("Cannot check schedule, current local time conversion failed.");
    } else {
        for (int i = 0; i < numTimeSlots; i++) {
            // Explicitly skip if timer slot data is invalid
            if (timeSlots[i].startTimeMinutes == -1 || timeSlots[i].stopTimeMinutes == -1) {
                continue;
            }

            // Check if current local time falls within this time slot
            if (timeSlots[i].startTimeMinutes < timeSlots[i].stopTimeMinutes) { // Normal case (e.g., 10:00 - 12:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes && currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            } else { // Overnight case (e.g., 22:00 - 02:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes || currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            }
        }
    }
  }

  isScheduledMovementActive = shouldMoveRandomlyThisCycle; // Update the global state
  if (isScheduledMovementActive) {
    // Ensure that currentScheduleStartTime and currentScheduleStopTime are not "N/A" before using them
    if (scheduledStartTime != "N/A" && scheduledStopTime != "N/A") {
        currentScheduleStartTime = scheduledStartTime; // Update the global start time
        currentScheduleStopTime = scheduledStopTime;   // Update the global stop time
        turnLaserOn();
    } else {
        // This case should ideally not be reached if shouldMoveRandomlyThisCycle is true
        // because minutesToTime should have provided valid strings.
        // But as a safeguard:
        isScheduledMovementActive = false; // Correct the state if times are N/A
        currentScheduleStartTime = "";
        currentScheduleStopTime = "";
    }
  } else {
    currentScheduleStartTime = ""; // Clear the global start time when no schedule is active
    currentScheduleStopTime = "";   // Clear the global stop time when no schedule is active
  }

  // Call random movement if the schedule says it should AND it's not overridden, OR if the button is toggled ON
  if ((isScheduledMovementActive && !scheduledMovementOverridden) || randomMotionActive) {
    moveServosRandomlyNonBlocking();
  }

  // New laser control logic:
  // The laser should be ON if:
  //   a) A scheduled movement is active (and not overridden) OR
  //   b) Random (manual) motion is active OR
  //   c) The `laserActive` flag (set by direct command like from UI configuration) is true.
  // Otherwise, it should be OFF.
  bool autoActivityDemandsLaser = (isScheduledMovementActive && !scheduledMovementOverridden) || randomMotionActive;

  if (autoActivityDemandsLaser) {
      digitalWrite(outputPin, HIGH); // Automated activity demands laser to be ON
  } else {
      // No automated activity demanding laser. State depends on the manual/timed `laserActive` flag.
      if (laserActive) {
          digitalWrite(outputPin, HIGH); // Laser was turned ON by command and should remain ON.
      } else {
          digitalWrite(outputPin, LOW);  // Laser is not demanded by activity and is commanded OFF.
      }
  }

  updateServoMovement(myservoX, movementX); // Update X servo movement
  updateServoMovement(myservoY, movementY); // Update Y servo movement
// The following block seems to be a repetition of the logic above for `isScheduledMovementActive` and `currentScheduleStart/StopTime`
// It should be removed to avoid redundancy and potential conflicts.
// The state of isScheduledMovementActive, currentScheduleStartTime, and currentScheduleStopTime
// is already correctly determined by the preceding block.

  // (Repetitive block removed)

  if (settingsMode) {
    displaySettings();
  } else {
    updateDisplay();
  }

  // Status Sending Logic
  static unsigned long lastStatusUpdateTime = 0;
  unsigned long statusUpdateInterval = 10000; // Send status every 10 seconds

  if (webSocketConnected && (millis() - lastStatusUpdateTime > statusUpdateInterval)) {
    lastStatusUpdateTime = millis();
    StaticJsonDocument<512> doc; // Increased size for more status data
    doc["type"] = "statusUpdate";
    // No need to send deviceId, server knows it from connection object

    JsonObject data = doc.createNestedObject("data");
    data["uptime_ms"] = millis();
    data["wifi_rssi"] = WiFi.RSSI();
    data["servoX_pos"] = myservoX.read();
    data["servoY_pos"] = myservoY.read();
    data["laser_active"] = digitalRead(outputPin) == HIGH;
    data["relay_active"] = relayActive; // relayActive is updated by RELAY_ON/OFF commands
    data["random_motion_active"] = randomMotionActive;
    data["is_scheduled_movement_active"] = isScheduledMovementActive;
    data["esp32cam_connected"] = esp32CamConnected;
    data["esp32cam_streaming"] = streaming;
    data["cam_led_active"] = camLedActive; // Include CAM LED state
    // Add servo limits to status update
    data["minX"] = minX;
    data["maxX"] = maxX;
    data["minY"] = minY;
    data["maxY"] = maxY;
    // Add other relevant status data

    String output;
    serializeJson(doc, output);
    webSocket.sendTXT(output);
    Serial.println("Sent status update: " + output);
  }

